update/sys_soap_message_function_7d0c047adbaff60075ea38ff9d96195a.xml

<?xml version="1.0" encoding="UTF-8"?>
<record_update table="sys_soap_message_function">
    <sys_soap_message_function action="INSERT_OR_UPDATE">
        <authentication_type>basic</authentication_type>
        <basic_auth_password/>
        <basic_auth_profile display_value="Oasis Web Service">bd275793db367a00d596327e9d9619e2</basic_auth_profile>
        <basic_auth_user/>
        <certificate/>
        <enable_mutual_auth>false</enable_mutual_auth>
        <envelope><![CDATA[<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:par="http://www.delphi-tech.com/ows/PartyChangeService" xmlns:par1="http://www.delphi-tech.com/ows/Party">
	<soapenv:Header/>
	<soapenv:Body>
		<par:PartyChangeRequest>
			<par:UserId>${PartyChangeRequest.UserId}</par:UserId>
			<par1:Organization key="${PartyChangeRequest.Organization}">
				<par1:OrganizationNumberId>${Organization.OrganizationNumberId}</par1:OrganizationNumberId>
				<par1:ClientId>${Organization.ClientId}</par1:ClientId>
				<par1:FEINId>${Organization.FEINId}</par1:FEINId>
				<par1:OrganizationName>
					<par1:FullName>${OrganizationName.FullName}</par1:FullName>
				</par1:OrganizationName>
				<par1:NationalProviderId>${Organization.NationalProviderId}</par1:NationalProviderId>
				<par1:BusinessEmail key="${Organization.BusinessEmail}">
					<par1:Email>${BusinessEmail.Email}</par1:Email>
				</par1:BusinessEmail>
			</par1:Organization>
			<par1:DataModificationInformation>
				<par1:ActionCode/>
				<par1:PreviousDataValueDescription>
					<par1:Organization key="${PartyChangeRequest.Organization}">
						<par1:OrganizationNumberId>${Organization.OrganizationNumberId}</par1:OrganizationNumberId>
					</par1:Organization>
				</par1:PreviousDataValueDescription>
			</par1:DataModificationInformation>
		</par:PartyChangeRequest>
	</soapenv:Body>
</soapenv:Envelope>]]></envelope>
        <function_name>insertOrganization</function_name>
        <key_store/>
        <key_store_alias/>
        <key_store_password/>
        <lock>false</lock>
        <protocol_profile/>
        <qualified_name>CAM-OASIS-PartyChangeService [ insertOrganization ]</qualified_name>
        <soap_action>partyChangeRequest</soap_action>
        <soap_endpoint>http://oasisdev.norcalmutual.com:8080/dev/eCIS/wsCIS/PartyChangeService</soap_endpoint>
        <soap_message display_value="CAM-OASIS-PartyChangeService">0db6d793db367a00d596327e9d961962</soap_message>
        <strip_whitespace>false</strip_whitespace>
        <sys_class_name>sys_soap_message_function</sys_class_name>
        <sys_created_by>rrao</sys_created_by>
        <sys_created_on>2017-06-27 19:38:17</sys_created_on>
        <sys_customer_update>false</sys_customer_update>
        <sys_id>7d0c047adbaff60075ea38ff9d96195a</sys_id>
        <sys_mod_count>22</sys_mod_count>
        <sys_name>insertOrganization</sys_name>
        <sys_package display_value="Medical Claim Management" source="x_norca_med_cam">4427741adb53fe8023cdd92b5e961942</sys_package>
        <sys_policy/>
        <sys_replace_on_upgrade>false</sys_replace_on_upgrade>
        <sys_scope display_value="Medical Claim Management">4427741adb53fe8023cdd92b5e961942</sys_scope>
        <sys_update_name>sys_soap_message_function_7d0c047adbaff60075ea38ff9d96195a</sys_update_name>
        <sys_updated_by>jpolk</sys_updated_by>
        <sys_updated_on>2017-10-26 19:13:09</sys_updated_on>
        <use_basic_auth>false</use_basic_auth>
        <use_mid_server display_value="">b755df81dbc04300d596327e9d961980</use_mid_server>
        <use_ws_security>false</use_ws_security>
        <ws_security_type/>
        <ws_security_username_profile/>
        <ws_security_x509_profile/>
    </sys_soap_message_function>
</record_update>
